Tekla Open API Reference for Tekla Structures 2025
View Constructor (ContainerView, CoordinateSystem, CoordinateSystem, AABB, String)
 Creates a new view instance with the given coordinate systems, model area and attributes file's filename.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View(
	ContainerView View,
	CoordinateSystem ViewCoordinateSystem,
	CoordinateSystem DisplayCoordinateSystem,
	AABB RestrictionBox,
	string Attributes
)
Public Sub New (
	View As ContainerView,
	ViewCoordinateSystem As CoordinateSystem,
	DisplayCoordinateSystem As CoordinateSystem,
	RestrictionBox As AABB,
	Attributes As String
)
Parameters
View
Type: Tekla.Structures.Drawing.ContainerView
The container view where the view is placed.
ViewCoordinateSystem
Type: Tekla.Structures.Geometry3d.CoordinateSystem
The coordinate system of the view restriction box.
DisplayCoordinateSystem
Type: Tekla.Structures.Geometry3d.CoordinateSystem
The coordinate system of the display plane.
RestrictionBox
Type: Tekla.Structures.Geometry3d.AABB
The restriction box describing the area of the model (in the view coordinate system).
Attributes
Type: System.String
The name of the attributes file to be used.
See Also
Reference
View Class
View Overload
Tekla.Structures.Drawing Namespace